docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kanishak | Home</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css" />
</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a class="active" href="./index.html">Home</a>
  <a href="./research-topics/index.html">Research Topics</a>
  <a href="./publications.html">Publications</a>
  <a href="./projects/index.html">Projects</a>
  <a href="./bio.html">Bio</a>
</ul>

<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">PhD fellow in IISc Bangalore</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>

<div id="outline-container-org5075cbf" class="outline-2">
<h2 id="org5075cbf">About Me</h2>
<div class="outline-text-2" id="text-org5075cbf">
<p>
I am PhD graduate from the Indian Institute of Science, Bangalore, with a research interest in wireless distributed systems. During my PhD, I have worked on distributed machine learning systems, broadcast networks for information retrieval and delivery, and wireless cache-aided networks, focusing on privacy and security.
</p>

<p>
After acquiring AIR 10 in GATE (EC) 2018, I joined IISc for an M.Tech in signal processing and upgraded to a PhD after one year. I have hands-on experience in image processing and computer vision projects. I also have a strong background in coding and information theory.
</p>
<hr />
</div>
<div id="outline-container-org2ef5b26" class="outline-3">
<h3 id="org2ef5b26">Achievements</h3>
<div class="outline-text-3" id="text-org2ef5b26">
<ul class="org-ul">
<li>Received Prime Minister&rsquo;s Research Fellowship (PMRF) from January 2020 to July 2023</li>
<li>Achieved All India Rank 10 in GATE EC 2018</li>
<li>Achieved All India Rank 20 in Junior Mathematical Olympiad 2011</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org17aa626" class="outline-3">
<h3 id="org17aa626">Education</h3>
<div class="outline-text-3" id="text-org17aa626">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Qualification</th>
<th scope="col" class="org-left">Institute</th>
<th scope="col" class="org-left">Specialization</th>
<th scope="col" class="org-left">Graduated</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>PhD</b></td>
<td class="org-left">IISc Bangalore</td>
<td class="org-left">Communications</td>
<td class="org-left">Nov 2023</td>
</tr>

<tr>
<td class="org-left"><b>M.Tech</b></td>
<td class="org-left">IISc Bangalore</td>
<td class="org-left">Signal Processing</td>
<td class="org-left">Jul 2023</td>
</tr>

<tr>
<td class="org-left"><b>B.Tech</b></td>
<td class="org-left">JNGEC Sundernagar</td>
<td class="org-left">Electronics and Communications</td>
<td class="org-left">Jul 2017</td>
</tr>

<tr>
<td class="org-left"><b>10+2</b></td>
<td class="org-left">KV Mandi</td>
<td class="org-left">Non Medical and Medical Science</td>
<td class="org-left">Mar 2013</td>
</tr>

<tr>
<td class="org-left"><b>Matriculation</b></td>
<td class="org-left">KV Mandi</td>
<td class="org-left">Science</td>
<td class="org-left">Mar 2011</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</body>
</html>
